let P1 = 0.88,
  P2 = 0.42,
  P3 = 0.05,
  P4 = 0.62,
  P5 = 0.44,
  P6 = 0.13,
  P7 = 0.22,
  P8 = 0.63,
  P9 = 0.27

let R12 = 1 - (1 - P1) * (1 - P2),
  R13 = 1 - (1 - P1) * (1 - P3),
  R23 = 1 - (1 - P2) * (1 - P3),
  R56 = P5 * P6,
  R78 = 1 - (1 - P7) * (1 - P8),
  R79 = 1 - (1 - P7) * (1 - P9),
  R89 = 1 - (1 - P8) * (1 - P9);

let S1 = R12 * R89,
  S2 = R13 * P4 * R78,
  S3 = R23 * R56 * R79;

let S4 = 1 - (1 - S2) * (1 - S3);

let res = S1 * S4;

console.log("Ймовірність безвідмовної роботи системи протягом 10 годин = ", res);
